Revit 2026 API

# View3DCanResetCameraTarget Method

---

Checks whether the camera target can be reset for this view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanResetCameraTarget()
```
```vb
Public Function CanResetCameraTarget As Boolean
```
```cpp
public:
bool CanResetCameraTarget()
```
```fsharp
member CanResetCameraTarget : unit -> bool
```

#### Return Value

Boolean True if camera target can be reset for this view, false otherwise.

The camera target can only be reset for perspective view.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace